In [1]:
import pandas as pd

In [3]:
url = 'https://tf-assets-prod.s3.amazonaws.com/tf-curric/data-science/web_events.csv'

df = pd.read_csv(url)

df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 2756101 entries, 0 to 2756100
Data columns (total 5 columns):
 #   Column         Dtype
---  ------         -----
 0   timestamp      int64
 1   visitorid      int64
 2   event          object
 3   itemid         int64
 4   transactionid  float64
dtypes: float64(1), int64(3), object(1)
memory usage: 105.1+ MB

Convert the values in the timestamp field to datetimes

In [19]:
df['timestamp'] = pd.to_datetime(df['timestamp'], unit='ms')

df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 2756101 entries, 0 to 2756100
Data columns (total 5 columns):
 #   Column         Dtype
---  ------         -----
 0   timestamp      datetime64[ns]
 1   visitorid      int64
 2   event          object
 3   itemid         int64
 4   transactionid  float64
dtypes: datetime64[ns](1), float64(1), int64(2), object(1)
memory usage: 105.1+ MB

Extract different time units from the timestamp field.

In [25]:

year = df.timestamp.dt.year
month = df.timestamp.dt.month
day = df.timestamp.dt.day
week = df.timestamp.dt.week

/usr/local/lib/python3.6/dist-packages/ipykernel_launcher.py:5: FutureWarning: Series.dt.weekofyear and Series.dt.week have been deprecated.  Please use Series.dt.isocalendar().week instead.
  """

Aggregate on each one, counting the number of records, and see what insights you can discover for each type of event.

In [26]:
print(f"Year: \n{year.value_counts()}\n")
print(f"Months: \n{month.value_counts()}\n")
print(f"Days: \n{day.value_counts()}\n")
print(f"Week: \n{week.value_counts()}\n")

Year:
2015    2756101
Name: timestamp, dtype: int64

Months:
7    697984
6    610393
5    590652
8    553362
9    303710
Name: timestamp, dtype: int64

Days:
14    103072
7     102839
15    102451
10    100289
8      99072
13     98174
4      98103
11     97610
6      97340
3      97334
9      96252
17     95948
12     94946
5      94349
26     93553
16     91599
25     90921
18     89176
27     85541
19     84312
20     82351
22     80932
28     80799
29     80723
24     80703
21     78672
2      77508
1      77197
23     75639
30     74730
31     53966
Name: timestamp, dtype: int64

Week:
30    175437
28    161845
21    152514
29    152243
20    148861
23    146445
25    145976
31    144337
22    141819
26    141688
27    139233
37    138789
19    133775
24    131852
32    128559
35    127810
34    126924
33    120763
36    119057
38     64491
18     13683
Name: timestamp, dtype: int64

Round datetimes by hour, aggregate, and see what insights you can discover.

In [24]:
may['timestamp'].dt.round('H')

1462519   2015-05-03 06:00:00
1462520   2015-05-03 05:00:00
1462521   2015-05-03 05:00:00
1462522   2015-05-03 05:00:00
1462523   2015-05-03 05:00:00
                  ...
2058975   2015-05-31 22:00:00
2058976   2015-05-31 21:00:00
2058977   2015-05-31 22:00:00
2058978   2015-05-31 21:00:00
2058979   2015-05-31 21:00:00
Name: timestamp, Length: 590652, dtype: datetime64[ns]

Load the life_expectancy.csv data set into a Pandas dataframe.

In [15]:
url2 = 'https://tf-assets-prod.s3.amazonaws.com/tf-curric/data-science/life_expectancy.csv'
df2 = pd.read_csv(url2)

df2.head()

  Country Name Country Code  ...    2015    2016
0        Aruba          ABW  ...  75.725  75.867
1  Afghanistan          AFG  ...  63.288  63.673
2       Angola          AGO  ...  61.241  61.547
3      Albania          ALB  ...  78.174  78.345
4      Andorra          AND  ...     NaN     NaN

[5 rows x 61 columns]

Transform/melt the data so that the years are listed in a single column instead of separate columns.

In [9]:
ids = ['Country Name', 'Country Code', 'Indicator Name', 'Indicator Code']

In [10]:
melt_fields = list(df2.columns.drop(ids))

In [16]:
melted = pd.melt(df2, id_vars=ids, value_vars=melt_fields, var_name='year', value_name='Value')

melted.head(10)

           Country Name Country Code  ...  year      Value
0                 Aruba          ABW  ...  1960  65.662000
1           Afghanistan          AFG  ...  1960  32.292000
2                Angola          AGO  ...  1960  33.251000
3               Albania          ALB  ...  1960  62.279000
4               Andorra          AND  ...  1960        NaN
5            Arab World          ARB  ...  1960  46.825065
6  United Arab Emirates          ARE  ...  1960  52.265000
7             Argentina          ARG  ...  1960  65.022000
8               Armenia          ARM  ...  1960  65.971000
9        American Samoa          ASM  ...  1960        NaN

[10 rows x 6 columns]

Practice address missing values for countries using the different approaches (imputation, interpolation, and deletion).

In [14]:
melted.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 15048 entries, 0 to 15047
Data columns (total 6 columns):
 #   Column          Non-Null Count  Dtype
---  ------          --------------  -----
 0   Country Name    15048 non-null  object
 1   Country Code    15048 non-null  object
 2   Indicator Name  15048 non-null  object
 3   Indicator Code  15048 non-null  object
 4   year            15048 non-null  object
 5   Value           13747 non-null  float64
dtypes: float64(1), object(5)
memory usage: 705.5+ KB

In [27]:
melted.Value.dropna()

0        65.662000
1        32.292000
2        33.251000
3        62.279000
5        46.825065
           ...
15043    71.646341
15044    64.953000
15045    62.774000
15046    61.874000
15047    61.163000
Name: Value, Length: 13747, dtype: float64